데이터프레임 샘플 확인

In [1]:
import pandas as pd

df = pd.read_csv('cafe.csv')
df

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

In [2]:
df.head()

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20

In [3]:
df.head(2)

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110

In [4]:
df.tail()

      메뉴    가격  칼로리
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

In [5]:
df.tail(3)

      메뉴    가격  칼로리
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

In [6]:
df.sample()

   메뉴    가격  칼로리
6  녹차  5300    0

In [7]:
df.sample(3)

     메뉴    가격  칼로리
6    녹차  5300    0
5   밀크티  5900  210
2  카페모카  5500  250

데이터프레임 크기

In [9]:
df.shape

(7, 3)

컬럼별 자료형

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int64
 2   칼로리     7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

상관 관계

In [11]:
df.corr(numeric_only = True)

           가격       칼로리
가격   1.000000  0.713227
칼로리  0.713227  1.000000

범주형 데이터 탐색

In [13]:
df_car = pd.DataFrame({
  "car" : ['Sedan', 'SUV', 'Sedan', 'SUV', 'SUV', 'SUV', 'Sedan', 'Sedan', 'Sedan', 'Sedan', 'Sedan'],
  "size" : ['S', 'M', 'S', 'S', 'M', 'M', 'L', 'S', 'S', 'M', 'S']
})

df_car.head()

     car size
0  Sedan    S
1    SUV    M
2  Sedan    S
3    SUV    S
4    SUV    M

고유한 값

In [14]:
df_car.nunique()

car     2
size    3
dtype: int64

In [15]:
df_car['car'].unique()

array(['Sedan', 'SUV'], dtype=object)

In [16]:
df_car['size'].unique()

array(['S', 'M', 'L'], dtype=object)

In [17]:
print(df_car['car'].value_counts())
print(df_car['size'].value_counts())

car
Sedan    7
SUV      4
Name: count, dtype: int64
size
S    6
M    4
L    1
Name: count, dtype: int64

기술통계

In [18]:
# 수치형 데이터

df.describe()

                가격         칼로리
count     7.000000    7.000000
mean   5028.571429  101.428571
std     631.702160   99.402980
min    4000.000000    0.000000
25%    4750.000000   15.000000
50%    5000.000000  110.000000
75%    5400.000000  160.000000
max    5900.000000  250.000000

In [19]:
# 범주형 데이터

df_car.describe(include = "O")

          car size
count      11   11
unique      2    3
top     Sedan    S
freq        7    6